//階乗とは数学の演算の一つで、N の階乗をN! と書きます。N が自然数であるとき、階乗は次のように計算できます。

//N! = N* (N - 1) * ... * 2 * 1


//N が与えられたとき、N! のすべての桁の代わりに、N! の最下位桁から続く0 をすべて除いた値の下位9桁を求めるプログラムを作成してください。
//9桁ではあるが先頭が0であるような場合は先頭の0を取り除いた値を出力してください。先頭に0のついた値を出力すると誤答となります。
//例えば N = 38 の時は以下のようになります。

//     条件

//すべてのテストケースにおいて、以下の条件をみたします。

//1 ≦ N ≦ 1000000

//     期待する出力

//N! の最下位桁から続く0 をすべて除いた値の下位9桁を出力して下さい。

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace paiza.poh.ando
{
    class ando13
    {
    }
}
